// Задача 19. Напишите программу, которая принимает на вход пятизначное число
// и проверяет, является ли оно палиндромом.


Console.WriteLine("Введите пятизначное число ");

int Palindrom (int num)
{
    int n = num;
    int rev = 0;
}

